{
  "title": "Automatic Time Update and Timezone Settings",
  "description": "Force enable the automatic update of date/time, as well as automatically setting the system's current time zone",
  "__version": "2.0",
  "__preferencedomain": "com.apple.timed",
  "properties": {
    "TMAutomaticTimeOnlyEnabled": {
      "title": "Force Automatic Date/Time Updates",
      "description": "If true, disables the ability to manually set the date and time",
      "type": "boolean",
      "propertyOrder": 5,
      "default": "true"
    },
    "TMAutomaticTimeZoneEnabled": {
      "title": "Set Timezone Automatically",
      "description": "If true, force enables setting the Time Zone automatically",
      "type": "boolean",
      "propertyOrder": 10,
      "default": "true"
    }
  }
}
