{
	"title": "macOS Firewall (com.apple.security.firewall)",
	"description": "Preference Domain: com.apple.security.firewall - Application: macOS Firewall settings.",
	"__preferencedomain": "com.apple.security.firewall",
	"__feedback": "shitttyscripts@gmail.com",
	"__version": "1.1",
	"properties": {
		"EnableFirewall": {
			"title": "Enable macOS Firewall",
			"description": "Set to true to enable the macOS Application Firewall. A firewall minimizes the threat of unauthorized users from gaining access to your system while connected to a network or the Internet. The firewall may block legitimate traffic. Applications that are unsigned will require special handling.",
			"propertyOrder": 5,
			"type": "boolean",
			"default": "false",
			"options": {
				"infoText": "Key: EnableFirewall"
			},
			"links": [
    		    {
     		     "rel": "More information",
     		     "href": "https://www.tenable.com/audits/items/CIS_Apple_macOS_12.0_Monterey_v1.0.0_L1.audit:de6839cd8c24abf0c1cccda7ae6cebba"
   			     }
			]
		},
	"EnableStealthMode": {
			"title": "Enable Firewall Stealth Mode",
			"description": "Set to true to enable Firewall Stealth Mode. While in Stealth mode the computer will not respond to unsolicited probes, dropping that traffic. Stealth mode on the firewall minimizes the threat of system discovery tools while connected to a network or the Internet. This key must be set in the same configuration profile with EnableFirewall set to true. If it is set in it's own configuration profile, it will fail.",
			"propertyOrder": 5,
			"type": "boolean",
			"default": "false",
			"options": {
				"infoText": "Key: EnableStealthMode"
			},
			"links": [
    		    {
     		     "rel": "More information",
     		     "href": "https://www.tenable.com/audits/items/CIS_Apple_macOS_12.0_Monterey_v1.0.0_L1.audit:ac4ada3e73f5433383bc8381daff963c"
   			     }
			]
		}
	}
}
