{
  "title": "Automatic Time Update and Timezone Settings",
  "description": "Force enable the automatic update of date/time, as well as automatically setting the system's current time zone",
  "__version": "1.0",
  "__preferencedomain": "com.apple.timed",
  "options": {
    "remove_empty_properties": true
  },
  "properties": {
     "TMAutomaticTimeOnlyEnabled": {
            "title": "Force Automatic Date/Time Updates Only",
            "description": "If true, disables the ability to manually set the date and time",
            "propertyOrder": 5,
            "anyOf": [
				{
					"title": "Not Configured",
					"type": "null"
				},
				{
					"title": "Configured",
					"type": "boolean",
					"default": true,
					"options": {
						"infoText": "Key: Automatic Time Only Enabled"
					}
				}
			]
		},
     "TMAutomaticTimeZoneEnabled": {
            "title": "Set Timezone Automatically",
            "description": "If true, force enables setting the Time Zone automatically",
            "propertyOrder": 10,
            "anyOf": [
				{
					"title": "Not Configured",
					"type": "null"
				},
				{
					"title": "Configured",
					"type": "boolean",
					"default": true,
					"options": {
						"infoText": "Key: Automatic Time Zone Enabled"
					}
				}
			]
		}
	}
}
